app/Models/TUsuarios.php

SELECT *
FROM `t_usuarios`
WHERE `usuario` = 'pusho.dev'
---
    public function obtenerUsuario($data)
    {

        $usuario = $this->db->table('t_usuarios');
        $usuario ->where($data);
        return $usuario->get()->getResultArray();