app/Models/Vacunas.php

SELECT COUNT(*) AS `numrows` FROM `vacunas`
---
    public function obtenerCantidaddeVacunas()
    {
        return $this->countAll();